ChibiOS/ChibiOS/os/hal/platforms/STM8S/stm8s.h
/*----------------------------------------------------------------------------*/
/**
  * @brief  LIN Universal Asynchronous Receiver Transmitter (UART3)
  */

typedef struct UART3_struct
{
  __IO uint8_t SR;       /*!< status register */
  __IO uint8_t DR;       /*!< data register */
  __IO uint8_t BRR1;     /*!< baud rate register */
  __IO uint8_t BRR2;     /*!< DIV mantissa[11:8] SCIDIV fraction */
  __IO uint8_t CR1;      /*!< control register 1 */
  __IO uint8_t CR2;      /*!< control register 2 */
  __IO uint8_t CR3;      /*!< control register 3 */
  __IO uint8_t CR4;      /*!< control register 4 */
  uint8_t RESERVED; /*!< Reserved byte */
  __IO uint8_t CR6;      /*!< control register 5 */
}
UART3_TypeDef;

/** @addtogroup UART3_Registers_Reset_Value
  * @{
  */

#define UART3_SR_RESET_VALUE   ((uint8_t)0xC0)
#define UART3_BRR1_RESET_VALUE ((uint8_t)0x00)
#define UART3_BRR2_RESET_VALUE ((uint8_t)0x00)
#define UART3_CR1_RESET_VALUE  ((uint8_t)0x00)
#define UART3_CR2_RESET_VALUE  ((uint8_t)0x00)
#define UART3_CR3_RESET_VALUE  ((uint8_t)0x00)
#define UART3_CR4_RESET_VALUE  ((uint8_t)0x00)
#define UART3_CR6_RESET_VALUE  ((uint8_t)0x00)

/**
  * @}
  */

/** @addtogroup UART3_Registers_Bits_Definition
  * @{
  */

#define UART3_SR_TXE      ((uint8_t)0x80) /*!< Transmit Data Register Empty mask */
#define UART3_SR_TC       ((uint8_t)0x40) /*!< Transmission Complete mask */
#define UART3_SR_RXNE     ((uint8_t)0x20) /*!< Read Data Register Not Empty mask */
#define UART3_SR_IDLE     ((uint8_t)0x10) /*!< IDLE line detected mask */
#define UART3_SR_OR       ((uint8_t)0x08) /*!< OverRun error mask */
#define UART3_SR_NF       ((uint8_t)0x04) /*!< Noise Flag mask */
#define UART3_SR_FE       ((uint8_t)0x02) /*!< Framing Error mask */
#define UART3_SR_PE       ((uint8_t)0x01) /*!< Parity Error mask */

#define UART3_BRR1_DIVM   ((uint8_t)0xFF) /*!< LSB mantissa of UARTDIV [7:0] mask */

#define UART3_BRR2_DIVM   ((uint8_t)0xF0) /*!< MSB mantissa of UARTDIV [11:8] mask */
#define UART3_BRR2_DIVF   ((uint8_t)0x0F) /*!< Fraction bits of UARTDIV [3:0] mask */

#define UART3_CR1_R8      ((uint8_t)0x80) /*!< Receive Data bit 8 */
#define UART3_CR1_T8      ((uint8_t)0x40) /*!< Transmit data bit 8 */
#define UART3_CR1_UARTD   ((uint8_t)0x20) /*!< UART Disable (for low power consumption) */
#define UART3_CR1_M       ((uint8_t)0x10) /*!< Word length mask */
#define UART3_CR1_WAKE    ((uint8_t)0x08) /*!< Wake-up method mask */
#define UART3_CR1_PCEN    ((uint8_t)0x04) /*!< Parity control enable mask */
#define UART3_CR1_PS      ((uint8_t)0x02) /*!< Parity selection bit mask */
#define UART3_CR1_PIEN    ((uint8_t)0x01) /*!< Parity interrupt enable bit mask */

#define UART3_CR2_TIEN    ((uint8_t)0x80) /*!< Transmitter Interrupt Enable mask */
#define UART3_CR2_TCIEN   ((uint8_t)0x40) /*!< Transmission Complete Interrupt Enable mask */
#define UART3_CR2_RIEN    ((uint8_t)0x20) /*!< Receiver Interrupt Enable mask */
#define UART3_CR2_ILIEN   ((uint8_t)0x10) /*!< IDLE Line Interrupt Enable mask */
#define UART3_CR2_TEN     ((uint8_t)0x08) /*!< Transmitter Enable mask */
#define UART3_CR2_REN     ((uint8_t)0x04) /*!< Receiver Enable mask */
#define UART3_CR2_RWU     ((uint8_t)0x02) /*!< Receiver Wake-Up mask */
#define UART3_CR2_SBK     ((uint8_t)0x01) /*!< Send Break mask */

#define UART3_CR3_LINEN   ((uint8_t)0x40) /*!< Alternate Function output mask */
#define UART3_CR3_STOP    ((uint8_t)0x30) /*!< STOP bits [1:0] mask */

#define UART3_CR4_LBDIEN  ((uint8_t)0x40) /*!< LIN Break Detection Interrupt Enable mask */
#define UART3_CR4_LBDL    ((uint8_t)0x20) /*!< LIN Break Detection Length mask */
#define UART3_CR4_LBDF    ((uint8_t)0x10) /*!< LIN Break Detection Flag mask */
#define UART3_CR4_ADD     ((uint8_t)0x0F) /*!< Address of the UART3 node mask */

#define UART3_CR6_LDUM    ((uint8_t)0x80) /*!< LIN Divider Update Method */
#define UART3_CR6_LSLV    ((uint8_t)0x20) /*!< LIN Slave Enable */
#define UART3_CR6_LASE    ((uint8_t)0x10) /*!< LIN Auto synchronization Enable */
#define UART3_CR6_LHDIEN  ((uint8_t)0x04) /*!< LIN Header Detection Interrupt Enable */
#define UART3_CR6_LHDF    ((uint8_t)0x02) /*!< LIN Header Detection Flag */
#define UART3_CR6_LSF     ((uint8_t)0x01) /*!< LIN Synch Field */

/**
  * @}
  */


/*----------------------------------------------------------------------------*/
/**
  * @brief  Controller Area Network  (CAN)
  */

typedef struct
{
  __IO uint8_t MCR;    /*!< CAN master control register */
  __IO uint8_t MSR;    /*!< CAN master status register */
  __IO uint8_t TSR;    /*!< CAN transmit status register */
  __IO uint8_t TPR;    /*!< CAN transmit priority register */
  __IO uint8_t RFR;    /*!< CAN receive FIFO register */
  __IO uint8_t IER;    /*!< CAN interrupt enable register */
  __IO uint8_t DGR;    /*!< CAN diagnosis register */
  __IO uint8_t PSR;    /*!< CAN page selection register */

  union
  {
    struct
    {
      __IO uint8_t MCSR;
      __IO uint8_t MDLCR;
      __IO uint8_t MIDR1;
      __IO uint8_t MIDR2;
      __IO uint8_t MIDR3;
      __IO uint8_t MIDR4;
      __IO uint8_t MDAR1;
      __IO uint8_t MDAR2;
      __IO uint8_t MDAR3;
      __IO uint8_t MDAR4;
      __IO uint8_t MDAR5;
      __IO uint8_t MDAR6;
      __IO uint8_t MDAR7;
      __IO uint8_t MDAR8;
      __IO uint8_t MTSRL;
      __IO uint8_t MTSRH;
    }
	  TxMailbox;

	struct
    {
      __IO uint8_t FR01;
      __IO uint8_t FR02;
      __IO uint8_t FR03;
      __IO uint8_t FR04;
      __IO uint8_t FR05;
      __IO uint8_t FR06;
      __IO uint8_t FR07;
      __IO uint8_t FR08;

      __IO uint8_t FR09;
      __IO uint8_t FR10;
      __IO uint8_t FR11;
      __IO uint8_t FR12;
      __IO uint8_t FR13;
      __IO uint8_t FR14;
      __IO uint8_t FR15;
      __IO uint8_t FR16;
    }
	Filter;
	

    struct
    {
      __IO uint8_t F0R1;
      __IO uint8_t F0R2;
      __IO uint8_t F0R3;
      __IO uint8_t F0R4;
      __IO uint8_t F0R5;
      __IO uint8_t F0R6;
      __IO uint8_t F0R7;
      __IO uint8_t F0R8;

